Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འཆི་བའི་ཆོས་ལ་ད་ལྟར་གྱི་ཚོར་བས་ཉམ་ཐག་པའི་ཕྱིར་གསོ་སྨན་སྦྱར་བར་བྱའོ། །
en: The fatal diseases must be dealt with medically to alleviate present pain and bring comfort.

source: ཇི་ལྟར་ན་ཚོར་བ་བསལ་བས་བདེ་བའི་དུས་བྱེད་པ།
en: [The fatal diseases must be dealt with medically to alleviate present pain] and bring comfort.

source: གང་གསོས་ན་འཚོལ་མ་གསོས་ན་འཆི་བ་དེ་ལ། སྨན་པས་སྲོག་ལ་ཕན་གདགས་པའི་ཕྱིར།
en: Those diseases that can be remedied when treated but otherwise will become fatal must be medically treated in order to protect the life-force.

source: གསོ་སྨན་སྦྱོར་བར་བྱེད་དེའཆི་བའི་ཆོས་ཀྱི་ཚོར་བ་བསལ་བའི་ཕྱིར། གསོ་སྨན་སྦྱོར་བར་བྱེད། འཚོ་བའི་ཆོས་ཀྱི་སྲོག་ལ་ཕན་གདགས་པའི་ཕྱིར། གསོ་སྨན་སྦྱོར་བར་བྱེད། མ་ངེས་པ་ལ་སྡུག་བསྔལ་གྱི་ཚོར་བས་ཉམ་ཐག་པ་མེད་པར་བྱ་བའི་ཕྱིར། རྩི་སྨན་སྦྱོར་བར་བྱེད་དེ།
en: Thus, medical treatment must be provided to dispel the sensations associated with fatal diseases, benefit the life-force with regard to diseases that can be remedied, and eliminate the agony produced by the indeterminate diseases.

source: ཇི་ལྟར་ན། སྡུག་བསྔལ་གྱི་ཚོར་བ་བསལ་བས་དུས་བྱེད་སྙམ་མོ། །
en: Hence, medical treatment is provided to dispel painful sensations.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the king and sage Sāgaramati was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the king and sage Sāgaramati.

source: ངས་སེམས་ཅན་དེ་དག་གི་ཚོར་བ་བསལ་བ་ཉེ་བར་བཟུང་ནས་ཇི་ལྟར་ན་ཚོར་བ་བསལ་ཏེ།
en: I provided treatment to those suffering from pain and healed them.

source: བདེ་བས་དུས་བྱེད་པར་འགྱུར་སྙམ་ནས་གསོ་སྨན་སྦྱར་ཏོ། །སེམས་ཅན་འཚོ་བའི་ཆོས་ཅན་རྣམས་ཇི་ལྟར་ན་ཉོན་མོངས་པ་མེད་པས་འཚོ་བར་འགྱུར་སྙམ་ནས་གསོས་སྨན་སྦྱར།
en: I sought to keep those enjoying good health free from affliction by offering them medical treatment.

source: གང་དག་གསོས་སྨན་མ་རྙེད་པར་དུས་བྱེད་པ་དེ་དག་གི་སྲོག་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་གསོ་སྨན་སྦྱར་ཏོ། །
en: And when I failed to find any cure for someone, I treated them so that they could complete their lives.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་བཤད་པ་ལེ་ལོ་མེད་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood must not be lazy when it comes to teaching the Dharma to sentient beings.

source: སྲོག་ཀྱང་བཏང་སྟེ་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཤིན་ཏུ་བསྟན་པར་བྱ།
en: They must teach everyone genuinely, even if it is at the cost of their lives.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཤིན་ཏུ་བསྟན་པ་ནི་ཐོས་པ་ལ་རྨོངས་པ་མེད་པར་འགྱུར་རོ།། །།
en: When the Dharma is taught genuinely, those who listen will become free from stupidity.

source: མཽད་གལ་གྱི་བུ་ངས་འཆི་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འཆི་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of death. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to the knowledge of death.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད། གཞལ་གྱིས་མི་ལང་བརྗོད་དུ་མེད་པའི་འཁོར་བ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཕྱི་མའི་མཐའ་སྒྲུབ་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless, incalculable, inconceivable, immeasurable, and inexpressible cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Skillful Achiever of the Future.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་དག་གི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: He possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་གཅིག་པུ་དབེན་པར་སོང་སྟེ་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་འདི་ལྟ་བུ་དག་སྐྱེས་ཏེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་གང་གིས་འགྲོ་བའི་བྱེ་བྲག་སྣང་ངོ་སྙམ་མོ། །
en: The sage had entered solitary retreat, and when thus practicing meditation, he began to wonder, ‘How can the ripening of karmic action make such different forms of life appear?

source: སེམས་ཅན་སྣ་ཚོགས་པ་ཡིན་ལ་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུད་ཀྱང་སྣ་ཚོགས་པ་ཡིན་ཏེ།
en: Sentient beings are of many different kinds and have many different states of mind.

source: དེ་ལྟར་ཉོན་མོངས་པ་སྣ་ཚོགས་དག་བྱུང་བས་ལས་སྣ་ཚོགས་དག་མངོན་པར་འདུ་བྱེད་པར་འགྱུར།
en: Because they experience different afflictions, they engage in different karmic acts.

source: ལས་སྣ་ཚོགས་དག་མངོན་པར་འདུ་བྱེད་པས་འགྲོ་བ་སྣ་ཚོགས་དག་དང་། སེམས་ཅན་དམྱལ་བ་རྣམས་ན་དམྱལ་བའི་བྱེ་བྲག །དུད་འགྲོའི་སྐྱེ་གནས་དག་ན་དུད་འགྲོའི་བྱེ་བྲག །གཤིན་རྗེའི་འཇིག་རྟེན་དག་ན་གཤིན་རྗེའི་བྱེ་བྲག །ལྷ་མ་ཡིན་དག་ན་ལྷ་མ་ཡིན་གྱི་བྱེ་བྲག །མི་དག་ལ་མིའི་བྱེ་བྲག། ལྷ་དག་ལ་ལྷའི་བྱེ་བྲག་དག་སྣང་ངོ་སྙམ་མོ། །
en: Thus, because their karmic conditioning differs, sentient beings differ as well. In the various hells there are different hell beings, the animal realms include many different kinds of animals, the inhabitants of the realms of the Lord of Death are of different types, and the same is the case with the beings who belong to the realms of demigods, humans, and gods.’

source: གང་གིས་འགྲོ་བ་དེ་དག་ཐམས་ཅད་བྱེ་བྲག་ཏུ་མི་འགྱུར་བའི་རྩི་སྨན་འགའ་ཡོད་དམ་སྙམ་མོ། །
en: ‘Might there be some form of medicine that is not just beneficial for certain types of sentient beings?

source: སེམས་ཅན་ཐམས་ཅད་བདག་ལ་རབ་ཏུ་གནས་ནས། ཉོན་མོངས་པ་ཤིན་ཏུ་བསྐྱེད་ཉོན་མོངས་པའི་སེམས་ཀྱིས་ལས་མངོན་པར་འདུ་བྱེད་དེ། དེ་དག་གི་རྣམ་པར་སྨིན་པ་སྣ་ཚོགས་གྲུབ་བོ། །
en: Well, all beings dwell on the self and so they generate many afflictions. The afflicted mind, in turn, engages in acts of karmic formation, and those acts come to ripen in various ways.

source: འོ་ན་བདག་གིས་ཆོས་དེ་དག་གི་བདག་གང་ཡིན་ཡོངས་སུ་བཙལ་བར་བྱའོ་སྙམ་ནས་
en: So I shall examine that self, which thus relates to all of that.

source: ཅི་བདག་གཟུགས་ཡིན་ནམ།
en: “ ‘So, could the self be a physical form?

source: གལ་ཏེ་རེ་ཞིག་བདག་གཟུགས་སུ་སྣང་ན་གཟུགས་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་ན་གང་གི་ཚེ་བདག་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པར་མཐོང་བ་དེ་ལྟར་ནི་མ་ཡིན་ཏེ
en: The self might appear to have physical form but, as physical forms grow or shrink, people do not perceive the self as simultaneously growing or shrinking.

source: དེ་ལྟ་བས་ན་བདག་གཟུགས་མ་ཡིན་ནོ། །
en: Hence, the self cannot be a physical form.

source: གལ་ཏེ་ཚོར་བ་བདག་ཡིན་ན་དེ་ཡིད་བདེ་བའི་གནས་དག་ལ་བདེ་བར་འགྱུར། ཡིད་མི་བདེ་བའི་གནས་དག་ལ་སྡུག་བསྔལ་བར་འགྱུར། བཏང་སྙོམས་ཀྱི་གནས་དག་ལ་སྡུག་བསྔལ་ཡང་མ་ཡིན། བདེ་བ་ཡང་མ་ཡིན་པར་འགྱུར་ཏེ།
en: Likewise, the self might be thought to be feelings. However, in happy states of mind the self would then be happiness, in painful states of mind the self would be suffering, and in neutral states of mind the self would be neither suffering nor happiness.

source: བདག་གི་མཚན་ཉིད་ནི་དེ་ལྟ་བུ་མ་ཡིན་པས་དེ་ལྟ་བས་ན་ཚོར་བ་བདག་མ་ཡིན།
en: That is not how it is with the self, and so the self cannot be feeling.

source: གལ་ཏེ་འདུ་ཤེས་བདག་ཡིན་ན་བདེ་བའི་ཚོར་བ་དག་ལ་བདེ་བ་རྗེས་སུ་འཇུག་པར་འགྱུར།
en: If it were perception, the self would transform into happiness with regard to pleasant feelings.

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་དག་ལ་སྡུག་བསྔལ་རྗེས་སུ་འཇུག་པར་འགྱུར།
en: It would transform into pain with regard to painful feelings.

source: སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་དག་ལ་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་རྗེས་སུ་འཇུག་པར་འགྱུར་ཏེ།
en: And it would transform into neither happiness nor pain with regard to feelings that are neither enjoyable nor painful.

source: གང་གཞན་གྱི་རྗེས་སུ་འཇུག་པར་འགྱུར་བ་དེ་ནི་བདག་གི་མཚན་ཉིད་མ་ཡིན་པས་དེ་ལྟ་བས་ན་འདུ་ཤེས་བདག་མ་ཡིན།
en: But such transformation into something else is not characteristic of the self and therefore the self cannot be perception.

source: གལ་ཏེ་འདུ་བྱེད་བདག་ཡིན་ན་དེ་དགེ་བ་དང་། མི་དགེ་བ་དང་། མི་གཡོ་བ་རྣམ་པ་གསུམ་སྟེ།
en: Moreover, if the self were formation it would be virtuous, unvirtuous, or non-transferring.

source: རྣམ་པ་གསུམ་པོ་དེ་དག་གི་རྣམ་པར་སྨིན་པ་བདེ་བ་དང་། སྡུག་བསྔལ་དང་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའོ། །
en: As such, it would ripen as pleasure, pain, or neither of the two.

source: དེ་ལ་ཅི་བདག་དགེ་བའམ་འོན་ཏེ་མི་དགེ་བའམ། འོན་ཏེ་མི་གཡོ་བའི་བདག་དེ་ནི་འགྱུར་བར་མི་འདོད་པས། དེ་ལྟ་བས་ན་འདུ་བྱེད་བདག་མ་ཡིན།
en: Yet the self is not held to be virtuous, unvirtuous, or non-transferring, and it therefore cannot be formation.

source: གལ་ཏེ་རྣམ་པར་ཤེས་པ་བདག་ཡིན་ན་ཅིའི་ཕྱིར་བདེ་བའི་ཚོར་བ་དག་ལ་བདེ་བར་རྗེས་སུ་འཇུག་པར་འགྱུར། སྡུག་བསྔལ་གྱི་ཚོར་བ་དག་ལ་སྡུག་བསྔལ་གྱི་རྗེས་སུ་འཇུག་པར་འགྱུར། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་དག་ལ་བཏང་སྙོམས་རྗེས་སུ་འཇུག་པར་འགྱུར།
en: Finally, if consciousness were the self, then why does consciousness transform into happiness, pain, and neutrality with regard to sensations that are either enjoyable, painful, or neither enjoyable nor painful, respectively?

source: བདག་དེ་ནི་འགྱུར་བར་མི་འདོད་པས་དེ་ལྟ་བས་ན་རྣམ་པར་ཤེས་པ་བདག་མ་ཡིན་ནོ་སྙམ་མོ། །
en: The self is not thought to change, and therefore consciousness cannot be the self.’

source: ཕུང་པོ་ལྔ་པོ་འདི་དག་ཐམས་ཅད་ནི་བདག་མེད་ཅིང་བདག་གི་བ་མེད་དེ།
en: ‘These five aggregates contain no self and nothing that is of the self.

source: ཉོན་མོངས་པ་དག་ལས་ལས། ལས་དག་ལས་རྣམ་པར་སྨིན་པ།
en: From the afflictions follow karmic actions, and those actions ripen.

source: རྣམ་པར་སྨིན་པ་ལས་ཉོན་མོངས་པ་སྟེ། དེ་ལྟར་གསུམ་པོ་འདིའི་རྒྱུན་མི་འཆད་པར་འགྱུར་རོ་སྙམ་མོ། །
en: The ripening of karmic actions brings affliction, and in this way these three factors are uninterrupted.’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་འཁོར་བཞི་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: “Having emerged from his absorption, the sage went on to teach the Dharma to the fourfold retinue, saying,

source: གྲོགས་པོ་དག་འདི་ལ་བདག་དང་བདག་གི་བ་མེད་དེ།
en: ‘Friends, here there is neither self nor anything that is of the self.

source: རྐྱེན་དག་ཡོད་ན་འདུ་བྱེད་རྣམས་འབྱུང་བར་འགྱུར་ལ། རྐྱེན་དག་མེད་ན་འདུ་བྱེད་རྣམས་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Formations occur when the conditions for those are present, and if their conditions are absent, so are the formations.’

source: དེ་དེ་ལྟར་ཆོས་སྟོན་པ་ན་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: “When the sage taught the Dharma in this way innumerably many tens of thousands of beings gained acceptance that phenomena are unborn.

source: འདིར་འདུ་བྱེད་འདི་དག་ལ་མ་གཏོགས་པར་ཆོས་གང་ཡང་སྐྱེ་བའམ། འཇིག་པའམ་འཆི་བ་མེད་དེ
en: Apart from karmic formation, there is no birth, destruction, or death of anything at all.

source: འདི་ལྟ་སྟེ། ཉོན་མོངས་པ་དག་ལས་ལས། ལས་དག་ལས་རྣམ་པར་སྨིན་པ་ཡིན་ནོ། །
en: Afflictions bring karmic action, and karmic action brings ripening.

source: ཆོས་འདི་དག་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ཏེ།
en: All phenomena are devoid of any essence;

source: ཉོན་མོངས་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བ། ལས་ཀྱི་ངོ་བོ་ཉིད་དང་བྲལ་བ། རྣམ་པར་སྨིན་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བའོ། །
en: they are devoid of any essence of affliction, karmic action, or ripening.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཕྱི་མའི་མཐའ་སྒྲུབ་པ་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Skillful Achiever of the Future was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཕྱི་མའི་མཐའ་སྒྲུབ་པ་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that sage Skillful Achiever of the Future.

source: ངས་ཉོན་མོངས་པ་དང་ལས་ཀྱི་གཏམ་དེ་ལྟ་བུ་དག་སྨྲས་པ་ན་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: Through my account of affliction and karmic action innumerably many tens of thousands of beings attained the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ལས་རྣམ་པར་གཞག་པ་གསུམ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings who wish to awaken to unsurpassed and perfect awakening must train in the three principles of karmic action.

source: མཽད་གལ་གྱི་བུ་ངས་འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created vast and boundless roots of virtue in order to understand cessation as related to knowledge of death. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of death.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Skilled in the Knowledge of Cessation as Related to the Knowledge of Death.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་དག་གི་འདོད་ཆགས་དང་བྲལ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་སྟེ
en: He possessed tremendous miraculous powers and splendor and, by means of the outer path, he had attained freedom from attachment to pleasures and gained the five superknowledges.

source: ཡིད་ཀྱིས་འདུས་བྱས་ཐམས་ཅད་ལ་ཡོད་པ་དང་། འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་འཇིག་པར་རྗེས་སུ་ལྟ་བ་ན་དེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: Bringing to mind all formed things, the sage saw that they disintegrate.

source: གང་གིས་མི་སྐྱེ་བ་དང་། མི་འགག་པའི་ཆོས་གང་ཡང་ཡོད་དམ་སྙམ་མོ། །
en: So he wondered, ‘Might there be any phenomenon that is not born and does not cease?

source: ཆོས་གང་མངོན་པར་འདུས་བྱས་པ་དེ་འགོག་པར་མི་འགྱུར་ལ། མངོན་པར་འདུ་མི་བྱེད་པ་ལ་ནི་འགོག་པ་མེད་དོ་སྙམ་མོ། །
en: Conditioned phenomena do come to an end whereas unconditioned phenomena do not cease.’

source: དེ་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་སོ་སོར་རྟོག་པ་ན་མངོན་པར་འདུ་མི་བྱེད་པའི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: “With this correct understanding in mind, the sage then entered the vajra-like absorption that is known as delighting in all unconditioned phenomena.

source: དེ་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་རབ་ཏུ་གནས་ནས་སེམས་ཀྱི་རྒྱུད་ལ་གང་དང་གང་སྐྱེ་བ་དེ་དང་དེ་སེམས་ཀྱི་རྒྱུད་ཉིད་ལ་སོ་སོར་རྟོག་ཅིང་རབ་ཏུ་རྟོག་སྟེ།
en: While thus dwelling in absorption, he examined and discerned all the mental events of the mindstream, and so he thought,

source: སེམས་ཀྱི་དབང་གིས་ཆོས་ཐམས་ཅད་སྐྱེ་སེམས་ཀྱི་དབང་གིས་ཆོས་ཐམས་ཅད་འགག་སྟེ།
en: ‘All phenomena arise due to the mind and cease due to the mind.

source: ཇི་ལྟ་ཇི་ལྟར་སེམས་ཀྱི་རྟོག་པ་དེ་ལྟ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་གཟུགས་སྟོན་པར་བྱེད།
en: Whatever form a phenomenon takes, it follows from the mind’s way of thinking.

source: སེམས་ནི་ཆོས་ཐམས་ཅད་སྐྱེད་པར་བྱེད། སེམས་ནི་ཆོས་ཐམས་ཅད་འགོག་པར་བྱེད་དོ་སྙམ་མོ། །
en: The mind gives birth to all phenomena, and the mind brings them all to an end.

source: སེམས་འདིའི་སེམས་ཀྱི་སྟོབས་བསྐྱེད་པ་གང་ཡིན།
en: But what gives the mind such power?’

source: སེམས་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པ་སྐྱེ་བ་ན་སེམས་བདག་ཉིད་མི་ཤེས་ཤིང་འགག་པ་ན་ཡང་སེམས་བདག་ཉིད་མི་ཤེས་ཏེ།
en: ‘The mind has no form and it cannot be shown. When it arises, the mind does not know its own identity and when it ceases, the mind also does not know its own identity.

source: སེམས་ཀྱིས་སེམས་དེ་མི་བསྐྱེད། སེམས་ཀྱིས་སེམས་མི་འགོག་པའི་སེམས་འདི་ནི་སེམས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་ནོ། །
en: The mind does not produce itself, and it does not make itself cease either. Such is the mind’s nature.

source: གཟུགས་ཅན་མ་ཡིན་པའི་ཆོས་འདི་ནི་ཆོས་ཉིད་དེ།
en: This immaterial quality is the intrinsic nature of things.

source: སེམས་འགོག་པ་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་པ་དེ་འབྱུང་ཞིང་སེམས་ཀྱི་རྒྱུད་རབ་ཏུ་འཇུག། །སེམས་གང་འགོག་པ་ན་སེམས་ཀྱི་རྒྱུད་འདྲ་བར་རབ་ཏུ་འཇུག་སྟེ།
en: The cessation of mind is not an object of consciousness. When the mind arises, it forms part of the mind’s continuum and when it ceases, it is also part of the mind’s continuum.

source: སྡང་བའི་སེམས་འགོག་པ་དེ་སེམས་ཀྱི་རྒྱུད་འདྲ་བར་རབ་ཏུ་འཇུག། །
en: The cessation of the aggressive mind is part of the mind’s continuum,

source: གཏི་མུག་གི་སེམས་འགོག་པ་དེ་སེམས་ཀྱི་རྒྱུད་འདྲ་བར་རབ་ཏུ་འཇུག་ཅིང་སེམས་ཀྱི་རྒྱུད་ལ་ཆགས་པའམ་སྡང་བ་ཞེས་གདགས་སོ། །
en: and the cessation of the ignorant mind is also part of the mind’s continuum. Thus one speaks of “desire or anger within the mind’s continuum.”

source: གང་གི་ཚེ་དེ་ཤེས་པ་དང་རབ་ཏུ་ལྡན་པའི་སེམས་བསྐྱེད་པ་དེའི་ཚེ་སེམས་ཀྱི་རྒྱུད་གསུམ་པོ་ཐམས་ཅད་རབ་ཏུ་ཤེས་ཏེ།
en: With a knowledgeable mind, one will know the mind’s three continua.

source: འདི་ལྟ་སྟེ་དཔེར་ན་མི་ལ་ལ་ཞིག་མུན་པར་སྣོད་ཡོངས་སུ་ཚོལ་བ་ན་ཏིལ་མར་གྱི་མར་མེ་བུས་ན་དེ་སྣང་བ་དེས་སྣོད་དེ་མཐོང་ཞིང་། དེ་ལས་གཞན་པའི་སྣོད་དག་ཀྱང་མཐོང་ངོ་། །
en: When, for example, a man searches for a jar in darkness he might light an oil lamp, and the light would then make him see the jar as well as other things.

source: དེ་བཞིན་དུ་གལ་ཏེ་འདོད་པའི་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་དཀྲིས་པའི་སེམས་འགགས་ཤིང་། གང་ཤེས་པ་དང་རབ་ཏུ་ལྡན་པའི་སེམས་སྐྱེ་ན་སེམས་ཀྱི་རྒྱུད་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཤེས་སོ། །
en: Likewise, when the mind driven by desire ceases, and the mind of knowledge arises, all the mind’s continua will be comprehended.

source: གལ་ཏེ་གནོད་སེམས་ཀྱིས་ཀུན་ནས་དཀྲིས་པའི་སེམས་འགགས་ཤིང་ཤེས་པ་དང་རབ་ཏུ་ལྡན་པའི་སེམས་སྐྱེ་ན་སེམས་ཀྱི་རྒྱུད་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཤེས་སོ། །
en: When the mind driven by the wish to harm ceases, and the mind of knowledge arises, all the mind’s continua will be comprehended.

source: གལ་ཏེ་གཏི་མུག་གིས་ཀུན་ནས་དཀྲིས་པའི་སེམས་འགགས་ཤིང་ཤེས་པ་དང་རབ་ཏུ་ལྡན་པའི་སེམས་སྐྱེ་ན་སེམས་ཀྱི་རྒྱུད་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཤེས་སོ། །
en: When the mind driven by ignorance ceases, and the mind of knowledge arises, all the mind’s continua will be comprehended.

source: དེ་དེ་ལྟར་རབ་ཏུ་ཤེས་ན་ཉོན་མོངས་པའི་སེམས་ཀྱི་རྣམ་པ་མི་མཐོང་སྟེ།
en: With such knowledge there is no perception of the features of affliction.

source: རྣམ་པར་ཤེས་པ་གང་གིས་སེམས་དེ་རབ་ཏུ་ལྡན་པར་མཐོང་བའི་སེམས་དེ་ཡང་མི་དམིགས་སོ། །
en: There is not even any observation of the mind that consciousness sees as being endowed with knowledge.

source: མ་རིག་པ་དང་ང་རྒྱལ་ཉིད་ཀྱིས་སེམས་དེའི་སེམས་ཀྱི་ངོ་བོ་དང་བྲལ་ཏེ།
en: Because that mind is of a nature that is free of ignorance and pride.

source: ཆོས་ངོ་བོ་གང་ཡང་མེད་ན་དེ་མི་སྐྱེའོ། །
en: That which has no essence at all does not arise,

source: གང་མི་སྐྱེ་བ་དེ་མི་འགག །
en: and what does not arise does not cease.

source: གང་མི་སྐྱེ་ཞིང་མི་འགག་པ་དེ་མངོན་པར་ཤེས་པར་བྱར་མེད།
en: That which neither arises nor ceases cannot be cognized,

source: ཡོངས་སུ་ཤེས་པར་བྱར་མེད།
en: comprehended,

source: སྤང་དུ་མེད།
en: relinquished,

source: བསྒོམ་དུ་མེད།
en: cultivated,

source: མངོན་སུམ་དུ་བྱར་མེད་དེ།
en: or perceived.

source: དེ་ད་ལྟར་གྱི་དུས་ཅི་འདྲ་བ་འདས་པ་ཡང་དེ་འདྲའོ། །
en: Just as it is now, so it was in the past.

source: འདས་པ་ཅི་འདྲ་བ་མ་འོངས་པ་ཡང་དེ་འདྲ་སྟེ།
en: Just as it was in the past, so it will be in the future.

source: དེ་མངོན་པར་ཤེས་པར་བྱར་མེད།
en: It cannot be cognized,

source: མངོན་སུམ་དུ་བྱར་མེད་དོ། །
en: or perceived.

source: གང་དུས་གསུམ་མཉམ་པ་འདི་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཀུན་ཏུ་རྨོངས་པ་དག་ཕུང་པོ་དབེན་པ་ལས་བྱང་ཆུབ་ཚོལ་ཏེ།
en: Despite this sameness of the three times, ordinary beings who are childish and obscured seek awakening apart from the aggregates.

source: བྱང་ཆུབ་ནི་ཕུང་པོ་དག་ལས་གཞན་པ་མ་ཡིན་ནོ་སྙམ་ནས།
en: But awakening is nothing other than the aggregates!’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། རང་བཞིན་དེ་དག་སེམས་ཅན་ལ་སྟོན་ཏོ། །
en: “When the sage had arisen from his absorption, he then proceeded to teach this nature to sentient beings.

source: གང་སློབ་པ་དེ་ལ་སློབ་པ་དེ་དག་གིས་རྗེས་སུ་ཐོབ་པར་འགྱུར་ཏེ།
en: He told them, ‘Whatever one trains in, it will yield particular attainments.

source: གང་སྔོན་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རྗེས་སུ་བརྙེས་པ། བསྣན་པ་མེད་ཕྲི་བ་མེད་ཐོབ་པ་མེད།
en: That which the blessed buddhas of the past attained is beyond increase, decrease, attainment, and destruction.

source: བཤིག་པ་མེད་མོད་ཀྱི་འོན་ཀྱང་ཆོས་ཀྱི་རང་བཞིན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་ན་དེའི་སྐྱེ་བ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན། མི་སྐྱེ་བ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན།
en: Nevertheless, if one fully recognizes the nature of phenomena, just as it is, then birth is transcendence of suffering, and no birth is transcendence of suffering as well.

source: འགགས་པ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན། མ་འགགས་པ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན།
en: Cessation is transcendence of suffering, just as no cessation is transcendence of suffering.

source: དངོས་པོ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན། དངོས་པོ་མེད་པ་ཡང་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ། །
en: Entity is transcendence of suffering, and no entity is transcendence of suffering as well.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the king and sage Skilled in the Knowledge of Cessation as Related to the Knowledge of Death was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the king and sage Skilled in the Knowledge of Cessation as Related to the Knowledge of Death.

source: ངས་དུས་གསུམ་མཉམ་པ་དེ་རབ་ཏུ་བསྟན་པ་ན་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus, by teaching them the equality of the three times, I established innumerably many tens of thousands of beings within the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཆོས་བསྟན་པར་བྱ། དུས་གསུམ་མཉམ་པ་ཉིད་ལ་སེམས་ཅན་དག་རབ་ཏུ་གཟུད་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas who wish to awaken to unexcelled and perfect buddhahood must teach the Dharma of the equality of the three times, and they must establish sentient beings within that equality.

source: དུས་གསུམ་མཉམ་པ་ཉིད་ལ་སེམས་ཅན་དག་རབ་ཏུ་བཙུད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Bodhisattvas who establish beings within the equality of the three times will quickly become irreversible from unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་ངས་འཆི་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ་བདག་གིས་ཇི་ལྟར་ཡང་དག་པར་བཤད་པར་བྱ་སྙམ་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created vast and boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of death. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of death.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བྲམ་ཟེ་ཟླ་དགའ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a brahmin named Joyous Moon, who was like a great sal tree.

source: ཕ་མ་ཤིན་ཏུ་དག་པ་དང་ལྡན་ཞིང་ཆུང་མའི་སྐྱེ་གནས་མ་བཏང་བ་འདོན་པ་གཞུང་འཛིན་པ།
en: His parents were extremely pure and he and his wife lived in celibacy.
